Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes
The DimensionExaggerationAttributes class handles attributes related to
the exaggeration of dimension lines.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationEnabled
Exaggeration is enabled if the value is true.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationDirection
The ExaggerationDirection.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationOrigin
The ExaggerationOrigin.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationWidth
The ExaggerationWidth.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationPosition
The ExaggerationPosition.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.ExaggerationHeight
The ExaggerationHeight.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.#ctor
Creates a new dimension exaggeration attributes instance.
The default is to have exaggeration disabled.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.#ctor(System.Boolean,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationDirections,Tekla.Structures.Drawing.DimensionSetBaseAttributes.ExaggerationOrigins,System.Double,System.Double,System.Double)
Creates a new dimension exaggeration attributes instance with the given parameters.
ExaggerationEnabled: Exaggeration is enabled if the value is true.
ExaggerationDirection:
ExaggerationOrigin:
ExaggerationWidth:
ExaggerationPosition:
ExaggerationHeight:

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionExaggerationAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.